; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?o1 ?o2)
	       (ontable ?o1)
	       (clear ?o1)
	       (handempty)
	       (holding ?o1)
	       )

  (:action pick-up
	     :parameters (?o1)
	     :precondition (and (clear ?o1) (ontable ?o1) (handempty))
	     :effect
	     (and (not (ontable ?o1))
		   (not (clear ?o1))
		   (not (handempty))
		   (holding ?o1)))

  (:action put-down
	     :parameters (?o1)
	     :precondition (and (holding ?o1))
	     :effect
	     (and (not (holding ?o1))
		   (clear ?o1)
		   (handempty)
		   (ontable ?o1)))
  (:action stack
	     :parameters (?o1 ?o2)
	     :precondition (and (holding ?o1) (clear ?o2))
	     :effect
	     (and (not (holding ?o1))
		   (not (clear ?o2))
		   (clear ?o1)
		   (handempty)
		   (on ?o1 ?o2)))
  (:action unstack
	     :parameters (?o1 ?o2)
	     :precondition (and (on ?o1 ?o2) (clear ?o1) (handempty))
	     :effect
	     (and (holding ?o1)
		   (clear ?o2)
		   (not (clear ?o1))
		   (not (handempty))
		   (not (on ?o1 ?o2)))))

; problem
(define (problem blocks-7-1)
  (:domain blocks)
  (:objects b -  object d -  object f -  object e -  object c -  object g -  object a -  object )
  (:init (ontable d) (clear b) (ontable b) (clear e) (ontable e) (on c d) (clear a) (ontable a) (clear g) (on g c) (holding f) )
  (:goal (and (ontable d)(on c d)(clear a)(ontable a)(on g c)(on f g)(on b f)(clear e)(handempty )(on e b)(not (on e e))(not (on e d))(not (on e f))(not (on e g))(not (on e c))(not (on e a))(not (on b e))(not (on b b))(not (on b d))(not (on b g))(not (on b c))(not (on b a))(not (on d e))(not (on d b))(not (on d d))(not (on d f))(not (on d g))(not (on d c))(not (on d a))(not (on f e))(not (on f b))(not (on f d))(not (on f f))(not (on f c))(not (on f a))(not (on g e))(not (on g b))(not (on g d))(not (on g f))(not (on g g))(not (on g a))(not (on c e))(not (on c b))(not (on c f))(not (on c g))(not (on c c))(not (on c a))(not (on a e))(not (on a b))(not (on a d))(not (on a f))(not (on a g))(not (on a c))(not (on a a))(not (ontable e))(not (ontable b))(not (ontable f))(not (ontable g))(not (ontable c))(not (clear b))(not (clear d))(not (clear f))(not (clear g))(not (clear c))(not (holding e))(not (holding b))(not (holding d))(not (holding f))(not (holding g))(not (holding c))(not (holding a)))))

; plan
1. (stack f g)
   deleted: (holding f) (clear g)
   added: (clear f) (handempty) (on f g)
   goals met: 65 of 71
2. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 65 of 71
3. (stack b f)
   deleted: (holding b) (clear f)
   added: (clear b) (handempty) (on b f)
   goals met: 68 of 71
4. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 66 of 71
5. (stack e b)
   deleted: (holding e) (clear b)
   added: (clear e) (handempty) (on e b)
   goals met: 71 of 71
